export const questions = [
    {
        q1: 'Что такое операционная система?',
        ans1: [
            'Это просто программа на компьютере, как и другие - Word или Chrome',
            'Это показатель того, какой процессор используется на компьютере. Например, 32-битный или 64-битный',
            'Это набор взаимосвязанных программ, осуществляющих управление компьютером и взаимодействие с пользователем',
            'Нет такого понятия, есть понятие "файловая система',
        ],
        corr1: 3,
    },
    {
        q2: 'Является ли Android операционной системой?',
        ans2: [
            'Да, это такая же ОС, как и другие, просто для мобильных девайсов',
            'Нет, операционные системы бывают только для ПК',
            'Нет, Android это программа, которая ставится на операционную систему девайса. ОС на разных девайсах разные',
            'Это домашняя страничка в настройках вашего браузера',
        ],
        corr2: 1,
    },
    {
        q3: 'Что такое процессор компьютера?',
        ans3: [
            'Это блок, внутри которого находится дисковод и много разъемов для монитора, клавиатуры и компьютерной мышки',
            'Это общее название всех комплектующих компьютера',
            'Это элемент компьютера, с помощью которого обрабатывается информация, находящаяся как в собственной памяти, так и в памяти других устройств',
            'Это суммарный показатель вычислительной мощности компьютера, например 2,7 ГГц',
        ],
        corr3: 3,
    },
    {
        q4: 'Какие бывают разрядности у современных процессоров?',
        ans4: ['32 и 64 бита', '12 и 32 бита', '15 и 32 бита', '86 и 64 бита'],
        corr4: 3,
    },
    {
        q5: 'Какой тип процессора чаще всего используют мобильные девайсы?',
        ans5: [
            'iOS использует Intel, остальные используют AMD',
            'Чаще всего используют Intel',
            'Чаще всего используют AMD',
            'Чаще всего используют ARM',
        ],
        corr5: 4,
    },
    {
        q6: 'Для чего компьютеру нужна RAM?',
        ans6: [
            'Для быстрого доступа к данным',
            'Для долгосрочного хранения данных',
            'Для правильной фрагментации памяти',
            'Для дефрагментации данных',
        ],
        corr6: 1,
    },
    {
        q7: 'Чем отличается HDD от SSD?',
        ans7: [
            'HDD - это твердотельный накопитель без подвижных частей. Более дешевый, чем SSD. HDD работает быстрее',
            'HDD - это твердотельный накопитель без подвижных частей. Более дорогой, чем SSD. HDD работает быстрее',
            'SSD - это твердотельный накопитель без подвижных частей. Более дешевый, чем HDD. SSD работает быстрее',
            'SSD - это твердотельный накопитель без подвижных частей. Более дорогой, чем HDD. SSD работает быстре',
        ],
        corr7: 4,
    },
    {
        q8: 'Как отличаются между собой USB?',
        ans8: [
            'Бывают только USB 2.0 и 3.2',
            'Бывают только micro-USB и mini-USB',
            'USB отличаются по пропускной способности (micro-USB, mini-USB, lightning и т.д.) и форме (USB 2.0, USB 3.2)',
            'USB отличаются по форме (micro-USB, mini-USB, lightning и т.д.) и пропускной способности (USB 2.0, USB 3.2',
        ],
        corr8: 4,
    },
    {
        q9: 'Какой файловой системы не существует?',
        ans9: ['Fat', 'NTFS', 'APFS', 'BolSFS'],
        corr9: 4,
    },
];
