export const dataQuestions = [
    {
        q: 'Какого типа данных нет в JS?',
        ans: ['undefined', 'symbol', 'integer', 'object'],
        corr: 3,
    },
    {
        q: 'Как расшифровывается HTTP?',
        ans: [
            'Протокол передачи гипертекста',
            'Протокол частичной передачи текста',
            'Личная передача гипертекста',
            'Практичная передача части текста',
        ],
        corr: 1,
    },
    {
        q: 'Что делает метод stopPropagation?',
        ans: [
            'Отменяет действие события браузера',
            'Останавливает цепочку вызова событий для последующих слушателей DOM элемента',
            'Прекращает дальнейшую передачу текущего события',
            'Вызывает событие',
        ],
        corr: 3,
    },
    {
        q: 'Отличие sessionStorage от LocalStorage?',
        ans: [
            'localStorage позволяет хранить больший объем данных чем sessionStorage',
            'sessionStorage отправляет данные на сервер при каждом запросе',
            'localStorage может использоваться для хранения файлов',
            'область видимости localStorage распространяется на все вкладки страницы, sessionStorage только на одну',
        ],
        corr: 1,
    },
    {
        q: 'Чему равняется контекст в момент вызова функции через оператор new?',
        ans: [
            'Первому переданному аргументу',
            'Последнему переданному аргументу',
            'Контекст не определен',
            'Пустому новому объекту',
        ],
        corr: 4,
    },
    {
        q: 'Что такое рекурсия?',
        ans: [
            'Функция, которая вызывает саму себя',
            'Абстрактный тип данных, представляющий собой список элементов, организованных по принципу LIFO',
            'Абстрактный тип данных, представляющий собой список элементов, организованных по принципу FIFO',
            'Структура данных, состоящая из элементов, содержащих помимо собственных данных ссылки на следующий и/или предыдущий элемент списка',
        ],
        corr: 1,
    },
    {
        q: 'Что делает метод event.preventDefault()?',
        ans: [
            'Останавливает цепочку вызова событий для последующих слушателей DOM элемента',
            'Удаляет обработчик события',
            'Вызывает событие',
            'Отменяет действие браузера',
        ],
        corr: 4,
    },
    {
        q: 'Каких структур данных нет в JS?',
        ans: ['Array', 'Map', 'Set', 'List'],
        corr: 4,
    },
    {
        q: 'Что такое Promise в JS?',
        ans: [
            'Функция для выполнения асинхронных операций: работой с API, базами данных, чтения файлов',
            'Метод сетевых запросов',
            'Тип данных JavaScript',
            'Специальный объект JavaScript, который используется для написания и обработки асинхронного кода',
        ],
        corr: 4,
    },
];
