export const dataQuestions = [
    {
        q: 'Что такое операционная система?',
        ans: [
            'Это просто программа на компьютере, как и другие - Word или Chrome',
            'Это показатель того, какой процессор используется на компьютере. Например, 32-битный или 64-битный',
            'Это набор взаимосвязанных программ, осуществляющих управление компьютером и взаимодействие с пользователем',
            'Нет такого понятия, есть понятие "файловая система"',
        ],
        corr: 3,
    },
    {
        q: 'Является ли Android операционной системой?',
        ans: [
            'Да, это такая же ОС, как и другие, просто для мобильных девайсов',
            'Нет, операционные системы бывают только для ПК',
            'Нет, Android это программа, которая ставится на операционную систему девайса. ОС на разных девайсах разные',
            'Это домашняя страничка в настройках вашего браузера',
        ],
        corr: 1,
    },
    {
        q: 'Что такое процессор компьютера?',
        ans: [
            'Это блок, внутри которого находится дисковод и много разъемов для монитора, клавиатуры и компьютерной мышки',
            'Это общее название всех комплектующих компьютера',
            'Это элемент компьютера, с помощью которого обрабатывается информация, находящаяся как в собственной памяти, так и в памяти других устройств',
            'Это суммарный показатель вычислительной мощности компьютера, например 2,7 ГГц',
        ],
        corr: 3,
    },
    {
        q: 'Какие бывают разрядности у современных процессоров?',
        ans: ['32 и 64 бита', '12 и 32 бита', '15 и 32 бита', '86 и 64 бита'],
        corr: 1,
    },
    {
        q: 'Какой тип процессора чаще всего используют мобильные девайсы?',
        ans: [
            'iOS использует Intel, остальные используют AMD',
            'Чаще всего используют Intel',
            'Чаще всего используют AMD',
            'Чаще всего используют ARM',
        ],
        corr: 4,
    },
    {
        q: 'Для чего компьютеру нужна RAM?',
        ans: [
            'Для быстрого доступа к данным',
            'Для долгосрочного хранения данных',
            'Для правильной фрагментации памяти',
            'Для дефрагментации данных',
        ],
        corr: 1,
    },
    {
        q: 'Чем отличается HDD от SSD?',
        ans: [
            'HDD - это твердотельный накопитель без подвижных частей. Более дешевый, чем SSD. HDD работает быстрее',
            'HDD - это твердотельный накопитель без подвижных частей. Более дорогой, чем SSD. HDD работает быстрее',
            'SSD - это твердотельный накопитель без подвижных частей. Более дешевый, чем HDD. SSD работает быстрее',
            'SSD - это твердотельный накопитель без подвижных частей. Более дорогой, чем HDD. SSD работает быстре',
        ],
        corr: 4,
    },
    {
        q: 'Как отличаются между собой USB?',
        ans: [
            'Бывают только USB 2.0 и 3.2',
            'Бывают только micro-USB и mini-USB',
            'USB отличаются по пропускной способности (micro-USB, mini-USB, lightning и т.д.) и форме (USB 2.0, USB 3.2)',
            'USB отличаются по форме (micro-USB, mini-USB, lightning и т.д.) и пропускной способности (USB 2.0, USB 3.2)',
        ],
        corr: 4,
    },
    {
        q: 'Какой файловой системы не существует?',
        ans: ['Fat', 'NTFS', 'APFS', 'BolSFS'],
        corr: 4,
    },
];
